# Задача 1: Паспорт объекта

# Ввод переменных
student_name = "Бабушкин Михаил Тимурович"
group_number = "3150801/10101"
project_name = "Дача Головина"
floors = 2
height = 14
is_residential = False
construction_year = 1905

# Вывод
print("=== ПАСПОРТ СТРОИТЕЛЬНОГО ОБЪЕКТА ===")
print("Составитель:", student_name)
print("Группа:", group_number)
print()
print("Объект:", project_name)
print("Этажность:", floors, "этажа")
print("Высота:", height, "м")

if is_residential:
    print("Тип: Жилой")
else:
    print("Тип: Нежилой")

print("Год постройки:", construction_year)
